Repository: WhiteCometHS/ThesisManagement
Catalog: DiplomaManagement/Resources/SharedResource.*.resx
Languages: pl_pl

source: Privacy
pl_pl: Prywatność

source: Register
pl_pl: Zarejestruj się

source: Institutes
pl_pl: Instytuty

source: Institute Directors
pl_pl: Dyrektorzy instytutów

source: Promoters
pl_pl: Promotorzy

source: Students without thesis
pl_pl: Studenci bez pracy dyplomowej

source: Students
pl_pl: Studenci

# login-modal-title
source: Login
pl_pl: Zaloguj się

source: Close
pl_pl: Zamknij

source: Email Address
pl_pl: Adres email

source: Enter password
pl_pl: Wprowadź hasło

source: Password
pl_pl: Hasło

source: Remember me
pl_pl: Zapamiętaj mnie

# registration-modal-title
source: Registration of new user
pl_pl: Rejestracja nowego użytkownika

source: User Name
pl_pl: Nazwa użytkownika

source: Confirm Password
pl_pl: Potwierdź hasło

source: First Name
pl_pl: Imię

source: Last Name
pl_pl: Nazwisko

source: Institute
pl_pl: Instytut

source: Select Institute
pl_pl: Wybierz instytut

# agreement
source: I accept the
pl_pl: Akceptuję

source: Terms of Use
pl_pl: Warunki użytkowania

source: and
pl_pl: i

source: Privacy Policy
pl_pl: Polityka prywatności

source: Name
pl_pl: Nazwa

source: Site Address
pl_pl: Adres strony

source: Street
pl_pl: Ulica

source: City
pl_pl: Miasto

source: Post Code
pl_pl: Kod pocztowy

source: Institute Email
pl_pl: Email Instytutu

# search-by-phrase
source: Find by phrase:
pl_pl: Znajdź według frazy:

source: Search
pl_pl: Szukaj

source: Back to Full List
pl_pl: Wróć do pełnej listy

source: Create New Record
pl_pl: Utwórz nowy rekord

# edit-button
source: Edit
pl_pl: Edytuj

# details-button
source: Details
pl_pl: Szczegóły

# delete-button
source: Delete
pl_pl: Usuń

source: List of all institutes
pl_pl: Lista wszystkich instytutów

# institute-delete-error
source: It is not possible to delete this institute as there is linked data. Check 'Promoters' and 'Directors' tables.
pl_pl: Nie jest możliwe usunięcie tego instytutu, ponieważ istnieją powiązane dane. Sprawdź tabele „Promoters” i „Directors”.

source: Save
pl_pl: Zapisz

source: Back to list
pl_pl: Powrót do listy

# edit-header
source: Edit
pl_pl: Edycja

# institute-deleted-message
source: {0} has beed successfully deleted.
pl_pl: {0} został pomyślnie usunięty.

source: Cancel
pl_pl: Anuluj

source: Submit
pl_pl: Zatwierdź

source: Confirm Action
pl_pl: Potwierdź akcję

# aus-institute-delete
source: Are you sure you want to delete that institute?
pl_pl: Czy na pewno chcesz usunąć ten instytut?

# director-delete-error
source: It is not possible to delete this director as there is linked data. Check 'Promoters' table.
pl_pl: Nie jest możliwe usunięcie tego dyrektora, ponieważ istnieją powiązane dane. Sprawdź tabelę 'Promoters'.

# director-deleted-message
source: Director ({0} {1}) has beed successfully deleted.
pl_pl: Dyrektor ({0} {1}) został pomyślnie usunięty.

source: List of all directors
pl_pl: Lista wszystkich dyrektorów

# aus-director-delete
source: Are you sure you want to delete that director?
pl_pl: Czy na pewno chcesz usunąć tego dyrektora?

# promoter-deleted-message
source: Promoter ({0} {1}) has beed successfully deleted.
pl_pl: Promotor ({0} {1}) został pomyślnie usunięty.

# aus-promoter-delete
source: Are you sure you want to delete that promoter?
pl_pl: Czy na pewno chcesz usunąć tego promotora?

source: List of all promoters
pl_pl: Lista wszystkich promotorów

source: Thesis Limit
pl_pl: Limit prac dyplomowych

source: Assigned director
pl_pl: Przypisany dyrektor

source: Director
pl_pl: Dyrektor

source: Assigned institute
pl_pl: Przypisany instytut

source: Reset password
pl_pl: Zresetuj hasło

source: New password
pl_pl: Nowe hasło

# reset-password-success
source: The password has been successfully reset.
pl_pl: Hasło zostało pomyślnie zresetowane.

source: Is seminar leader
pl_pl: Prowadzący seminarium

source: List of all students
pl_pl: Lista wszystkich studentów

source: Thesis Title
pl_pl: Tytuł pracy

# list-of-students-without-thesis
source: List of thesis-unassigned students
pl_pl: Lista studentów nieprzypisanych do pracy dyplomowej

# no-students-without-thesis
source: There are no students without assigned thesis
pl_pl: Brak studentów bez przypisanej pracy dyplomowej

source: Student enrollments
pl_pl: Zgłoszenia studentów

# pager-first
source: First
pl_pl: Pierwsza

# pager-previous
source: Previous
pl_pl: Poprzednia

# pager-next
source: Next
pl_pl: Następna

# pager-last
source: Last
pl_pl: Ostatnia

source: Logout
pl_pl: Wyloguj się

source: Hello
pl_pl: Witaj

source: Your theses
pl_pl: Twoje tematy

source: Enrollments
pl_pl: Zgłoszenia

source: Active theses
pl_pl: Aktywne prace dyplomowes

source: Theses management
pl_pl: Zarządzanie pracami

source: Theses
pl_pl: Pracy dyplomowe

source: List of all your theses
pl_pl: Lista wszystkich twoich prac dyplomowych

source: Title
pl_pl: Tytuł

source: Description
pl_pl: Opis

source: Uploaded example
pl_pl: Załączony przykład

# aus-thesis-delete
source: Are you sure you want to delete that thesis?
pl_pl: Czy na pewno chcesz usunąć tę pracę?

# thesis-limit-reached-message
source: You have reached the maximum number of theses: {0}.
pl_pl: Osiągnięto maksymalną liczbę prac dyplomowych: {0}.

source: Thesis
pl_pl: Praca dyplomowa

source: Upload example file
pl_pl: Załaduj wzorzec pracy

# download-button
source: Download
pl_pl: Pobierz

source: File Name
pl_pl: Nazwa pliku

source: Extension
pl_pl: Rozszerzenie pliku

source: Type/Status
pl_pl: Typ/Status

source: Actions
pl_pl: Akcje

# aus-file-delete
source: Are you sure you want to delete the file {0}?
pl_pl: Czy na pewno chcesz usunąć plik {0}?

# example-type
source: Example
pl_pl: Przykład

# original-type
source: Original
pl_pl: Oryginał

source: Student (Name Surname)
pl_pl: Student (Imię Nazwisko)

source: Student email
pl_pl: E-mail studenta

source: Active enrollments
pl_pl: Aktywne zgłoszenia

# no-active-enrollments
source: There is no active enrollments in your theses.
pl_pl: Nie ma aktywnych zgłoszeń do prac dyplomowych.

source: Name and Surname
pl_pl: Imię i nazwisko

# change-thesis-limit-globaly
source: Change limit globaly for all promoters
pl_pl: Zmień limit globalnie dla wszystkich promotorów

# thesis-limit-change-success
source: Thesis limit for promoter with id: {0} has been successfully changed.
pl_pl: Limit tezy dla promotora o id: {0} został pomyślnie zmieniony.

# thesis-limit-global-change-success
source: Thesis limit has been successfully changed for all promoters.
pl_pl: Limit prac dyplomowych został z powodzeniem zmieniony dla wszystkich promotorów.

source: Available promoters
pl_pl: Dostępni promotorzy

source: Available theses
pl_pl: Dostępne prace dyplomowe

# already-have-assigned-thesis
source: You already have assigned thesis. You won't be able to enroll for another one.
pl_pl: Masz już przypisaną pracę dyplomową. Nie będziesz mógł zapisać się na kolejną.

source: Promoter (Name Surname)
pl_pl: Promotor (Imię Nazwisko)

source: Enroll in
pl_pl: Zgłoś się

# already-created-enrollment
source: You have already created enrollment for this thesis.
pl_pl: Utworzono już zgłoszenie dla tej pracy dyplomowej.

# enrollment-created-success
source: Your enrollment has been created successfully.
pl_pl: Zgłoszenie zostało pomyślnie utworzone.

# uploaded-files-success
source: Your files has been added to the system. Please, wait for promoter to check it.
pl_pl: Twoje pliki zostały dodane do systemu. Poczekaj, aż promotor je sprawdzi.

# thesis-delete-error
source: You cant delete thesis with an assigned student.
pl_pl: Nie można usunąć pracy dyplomowej z przypisanym studentem.

# file-delete-success
source: File has been successfully deleted.
pl_pl: Plik został pomyślnie usunięty.

# no-available-theses
source: There is no available theses right now, please try again later.
pl_pl: W tej chwili nie ma dostępnych prac dyplomowych, spróbuj ponownie później.

# auto-assign-success
source: {0} students have been successfully processed and assigned to available theses.
pl_pl: {0} studentów zostało pomyślnie przetworzonych i przypisanych do dostępnych prac dyplomowych.

# auto-assign-selected-student-success
source: Selected student have been successfully processed and assigned to available thesis.
pl_pl: Wybrani studenci zostali pomyślnie przetworzeni i przypisani do dostępnych prac.

# no-students-in-institute
source: There are no students assigned to that institute yet.
pl_pl: Nie ma jeszcze studentów przypisanych do tego instytutu.

# students-of-institute
source: All students of the institute
pl_pl: Wszyscy studenci instytutu

source: No thesis assigned
pl_pl: Nie przypisano tematu pracy

source: Thesis details
pl_pl: Szczegóły pracy

# no-created-theses
source: You don't have any theses created yet. Click here to create one
pl_pl: Nie utworzyłeś jeszcze żadnej pracy dyplomowej. Kliknij tutaj, aby ją utworzyć

source: Creation
pl_pl: Tworzenie

source: Upload example file (optional)
pl_pl: Załaduj przykładowy plik (opcjonalnie)

source: Your thesis
pl_pl: Twoja praca dyplomowa

source: New thesis
pl_pl: Nowa praca dyplomowa

source: List of all theses
pl_pl: Lista wszystkich prac dyplomowych

source: Promoter
pl_pl: Promotor

source: Comment
pl_pl: Komentarz

source: Thesis Sophistication
pl_pl: Zaawansowanie pracy dyplomowej

source: Additional materials
pl_pl: Materiały dodatkowe

# thesis-dont-have-additional-materials
source: Thesis don't have additional materials attached by promoter
pl_pl: Praca dyplomowa nie zawiera dodatkowych materiałów dołączonych przez promotora

source: Thesis don't have uploaded files
pl_pl: Praca dyplomowa nie ma przesłanych plików

# aus-submit-enrollment
source: Are you sure you want to submit enrollment for this student? All other enrollments for this thesis will be declined.
pl_pl: Czy na pewno chcesz przesłać rejestrację dla tego studenta? Wszystkie inne zapisy dla tej pracy dyplomowej zostaną odrzucone.

# assign-selected-student-success
source: Selected student have been successfully assigned to your thesis.
pl_pl: Wybrany student został pomyślnie przypisany do pracy dyplomowej.

source: Upload your files
pl_pl: Prześlij pliki

# upload-pdf-file
source: Attach your pdf file
pl_pl: Załącz plik pdf

# upload-presentation-file
source: Attach your presentation file (optional)
pl_pl: Załącz plik z prezentacją (opcjonalne)

# upload-at-least-one-file
source: Please upload at least one file.
pl_pl: Prześlij co najmniej jeden plik.

# file-status-change-success
source: File status has been successfully changed to
pl_pl: Status pliku został pomyślnie zmieniony na

# comment-update-success
source: Comments updated successfully.
pl_pl: Komentarz został pomyślnie zaktualizowany.

# sophistication-update-success
source: Thesis sophistication updated successfully.
pl_pl: Ocena zaawansowania pracy dyplomowej została pomyślnie zaktualizowana.

# change-thesis-status-message
source: If you have reviewed all aspects of the thesis and are satisfied with the progress, you can proceed to change its status to Accepted. Please be aware that once you confirm this decision, the status will be permanently set, and further modifications or reversals will not be possible. This action signifies that the thesis has met all the necessary criteria and is ready for final submission or evaluation. Ensure that all details are correct and thoroughly reviewed before proceeding, as this step cannot be undone later.
pl_pl: Jeśli przejrzałeś wszystkie aspekty pracy dyplomowej i jesteś zadowolony z postępów, możesz zmienić jej status na Zaakceptowany. Należy pamiętać, że po potwierdzeniu tej decyzji status zostanie ustawiony na stałe, a dalsze modyfikacje lub cofnięcia nie będą możliwe. Ta czynność oznacza, że praca dyplomowa spełniła wszystkie niezbędne kryteria i jest gotowa do ostatecznego złożenia lub oceny. Przed kontynuowaniem upewnij się, że wszystkie szczegóły są poprawne i dokładnie sprawdzone, ponieważ tego kroku nie można później cofnąć.

# accept-thesis-button
source: Accept thesis
pl_pl: Zaakceptuj pracę

# not-verified-status
source: Not verified
pl_pl: Nie zweryfikowano

# not-accepted-status
source: Not accepted
pl_pl: Nie zaakceptowano

# accepted-status
source: Accepted
pl_pl: Zaakceptowano

# thesis_status_changed
source: Thesis status has been successfully changed to Accepted
pl_pl: Status pracy dyplomowej został pomyślnie zmieniony na Zaakceptowany
